tests/positionCorrectionTest/simple/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (0 0 0) // 0
    (6 0 0) // 1
    (6 2 0) // 2
    (0 2 0) // 3
    (0 0 2) // 4
    (6 0 2) // 5
    (6 2 2) // 6
    (0 2 2) // 7
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (33 11 1) simpleGrading (1 1 1)
);

edges
(
);

patches
(
    patch open
    (
        (0 4 7 3)
        (2 6 5 1)
    )
    patch walls
    (
        (3 7 6 2)
        (1 5 4 0)
    )
    empty frontAndBack
    (
        (0 3 2 1)
        (4 5 6 7)
    )
);

mergePatchPairs
(
);

// ************************************************************************* //
