tests/positionCorrectionTest/simple/0.org/rho
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      rho;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -3 0 0 0 0 0];

internalField   uniform 1;

boundaryField
{
    open
    {
        type            inletOutlet;
        inletValue      $internalField;
    }
    walls
    {
        type            slip;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
